Amiya200/stm32_water_tank/Core/Src/model_handle.c
uint8_t ModelHandle_GetRetryCount(void) {
    return user_retry_count;
}

uint16_t ModelHandle_GetUnderVolt(void) {
    return user_uv_limit;
}

uint16_t ModelHandle_GetOverVolt(void) {
    return user_ov_limit;
}

float ModelHandle_GetOverloadLimit(void) {
    return user_overload;
}

float ModelHandle_GetUnderloadLimit(void) {
    return user_underload;
}

uint16_t ModelHandle_GetMaxRunTime(void) {
    return user_maxrun_min;
}
void ModelHandle_SetUserSettings(
    uint16_t gap_s,
    uint8_t retry,
    uint16_t uv,
    uint16_t ov,
    float overload,
    float underload,
    uint16_t maxrun_min
){
    sys.gap_time_s = gap_s;
    sys.retry_count = retry;
    sys.uv_limit = uv;
    sys.ov_limit = ov;
    sys.overload = overload;
    sys.underload = underload;
    sys.maxrun_min = maxrun_min;

    ModelHandle_SaveSettingsToEEPROM();
}

void ModelHandle_FactoryReset(void)
{
    user_gap_s       = 10;
    user_retry_count = 3;
    user_uv_limit    = 180;
    user_ov_limit    = 260;
    user_overload    = 6.5f;
    user_underload   = 0.5f;
    user_maxrun_min  = 120;

    // Optional: EEPROM_SaveDefaults();
}

static inline void clear_all_modes(void)
{
    manualActive    = false;
    semiAutoActive  = false;
    countdownActive = false;
    twistActive     = false;
    timerActive     = false;
    autoActive      = false;
    manualOverride  = false;
}

/***************************************************************
 *  MOTOR CONTROL (ANTI-CHATTER)
 ***************************************************************/
static inline void motor_apply(bool on)
{
    if (on == Motor_GetStatus())
        return;

    Relay_Set(1, on);
    motorStatus = on ? 1 : 0;

    UART_SendStatusPacket();
}

static inline void start_motor(void) { motor_apply(true); }
static inline void stop_motor(void)  { motor_apply(false); }

bool Motor_GetStatus(void)
{
    return (motorStatus == 1);
}

/***************************************************************
 *  MANUAL MODE CONTROL
 ***************************************************************/
void ModelHandle_SetMotor(bool on)
{
    clear_all_modes();
    manualOverride = true;

    /* In manual mode dry-run is disabled */
    senseDryRun = false;

    if (on) start_motor();
    else    stop_motor();
}

/* RESET pump logic (SW1 short press) */
void reset(void)
{
    if (Motor_GetStatus())
    {
        stop_motor();
        HAL_Delay(2000);
        start_motor();
    }
    else
    {
        start_motor();
        HAL_Delay(2000);
        stop_motor();
    }
}

/***************************************************************
 *  TANK FULL DETECTION
 *  (5 ADC probes = level sensors)
 ***************************************************************/

void ModelHandle_StopAllModesAndMotor(void)
{
    manualActive     = false;
    semiAutoActive   = false;
    timerActive      = false;
    countdownActive  = false;
    twistActive      = false;
    autoActive       = false;
    ModelHandle_SaveModeState();
    ModelHandle_SetMotor(false);   // turn OFF motor safely
}

static inline bool isTankFull(void)
{
    static uint32_t stableStart = 0;
    static bool lastState = false;

    bool allZero = true;

    for (int i = 1; i <= 5; i++)
    {
        if (adcData.voltages[i] > 0.10f)
        {
            allZero = false;
            break;
        }
    }

    uint32_t now = HAL_GetTick();

    if (allZero)
    {
        if (!lastState)
        {
            lastState = true;
            stableStart = now;
        }

        if (now - stableStart >= 1000)
            return true;
    }
    else
    {
        lastState = false;
    }

    return false;
}

/***************************************************************
 *  DRY-RUN SENSOR CHECK
 *  Voltage <=0.01f → WATER PRESENT → dry=false
 *  Voltage > 0.01f → DRY → dry=true
 ***************************************************************/
void ModelHandle_CheckDryRun(void)
{
    /* Countdown, Semi-Auto, Manual ignore dry-run */
    if (manualActive || semiAutoActive || countdownActive)
    {
        senseDryRun = false;
        return;
    }

    float v = adcData.voltages[0];

    if (v > 0.01f)
        senseDryRun = false;   // WATER PRESENT
    else
        senseDryRun = true;    // DRY
}
void ModelHandle_ToggleManual(void)
{
    // Stop all other modes before manual
    timerActive     = false;
    semiAutoActive  = false;
    countdownActive = false;
    twistActive     = false;
    autoActive      = false;

    manualActive = !manualActive;
    ModelHandle_SaveModeState();
    if (manualActive)
    {
        manualOverride = true;
        start_motor();
    }
    else
    {
        manualOverride = false;
        stop_motor();
    }
}


/***************************************************************
 *  SOFT DRY-RUN FSM
 ***************************************************************/
typedef enum {
    DRY_IDLE = 0,
    DRY_PROBE,
    DRY_NORMAL
} DryFSMState;

static DryFSMState dryState = DRY_IDLE;
static bool dryConfirming   = false;

static uint32_t dryDeadline     = 0;
static uint32_t dryConfirmStart = 0;

#define DRY_PROBE_ON_MS      5000UL
#define DRY_PROBE_OFF_MS    10000UL
#define DRY_CONFIRM_MS       1500UL

static inline bool isAnyModeActive(void)
{
    return (manualActive ||
            semiAutoActive ||
            countdownActive ||
            twistActive ||
            timerActive ||
            autoActive);
}

void ModelHandle_SoftDryRunHandler(void)
{
    uint32_t now = now_ms();

    /***********************************************************
     * 1) COUNTDOWN MODE → Dry-run fully bypassed
     ***********************************************************/
    if (countdownActive)
    {
        dryState       = DRY_IDLE;
        dryConfirming  = false;
        dryDeadline    = 0;
        dryConfirmStart= 0;
        return;
    }

    /***********************************************************
     * 2) Normal dry-run check
     ***********************************************************/
    ModelHandle_CheckDryRun();

    /* No active mode → motor off + reset FSM */
    if (!isAnyModeActive())
    {
        stop_motor();
        dryState       = DRY_IDLE;
        dryConfirming  = false;
        dryDeadline    = 0;
        return;
    }

    /***********************************************************
     * 3) FSM OPERATION
     ***********************************************************/
    switch (dryState)
    {
    case DRY_IDLE:
        if (senseDryRun)  // water present
        {
            start_motor();
            dryState = DRY_NORMAL;
        }
        else              // dry
        {
            if (now >= dryDeadline)
            {
                start_motor();
                dryState = DRY_PROBE;
                dryDeadline = now + DRY_PROBE_ON_MS;
            }
        }
        break;

    case DRY_PROBE:
        if (senseDryRun)   // water found
        {
            dryState = DRY_NORMAL;
        }
        else if (now >= dryDeadline)
        {
            stop_motor();
            dryState = DRY_IDLE;
            dryDeadline = now + DRY_PROBE_OFF_MS;
        }
        break;

    case DRY_NORMAL:
        if (!senseDryRun)   // DRY detected
        {
            if (!dryConfirming)
            {
                dryConfirming = true;
                dryConfirmStart = now;
            }
            else if (now - dryConfirmStart >= DRY_CONFIRM_MS)
            {
                stop_motor();
                dryState = DRY_IDLE;
                dryConfirming = false;
                dryDeadline = now + DRY_PROBE_OFF_MS;
            }
        }
        else
        {
            dryConfirming = false;
        }
        break;
    }
}

/***************************************************************
 *  LEGACY ENTRY POINT
 ***************************************************************/
void ModelHandle_ProcessDryRun(void)
{
    ModelHandle_SoftDryRunHandler();
}
/***************************************************************
 * ======================== TIMER MODE =========================
 * DS1307 dow: 1=Mon to 7=Sun
 * dayMask: bit0=Mon to bit6=Sun
 ***************************************************************/

/* Convert RTC DOW into bit mask */
static inline uint8_t get_today_mask(void)
{
    uint8_t dow = time.dow;  /* valid range 1..7 */
    if (dow < 1 || dow > 7)
        dow = 1;
    return (1u << (dow - 1)); /* Mon->bit0 ... Sun->bit6 */
}

