Amiya200/stm32_water_tank/Core/Src/model_handle.c
    if (seconds == 0)
    {
        countdownActive = false;
        countdownDuration = 0;
        return;
    }

    countdownActive = true;
    countdownDuration = seconds;
    ModelHandle_SaveModeState();
    cd_deadline = now_ms() + seconds * 1000UL;

    start_motor();   // countdown ALWAYS forces motor ON
}

/* Update remaining time */
static void countdown_tick(void)
{
    if (!countdownActive)
        return;

    uint32_t now = now_ms();

    /* Tank full → stop immediately */
    if (isTankFull())
    {
        ModelHandle_StopCountdown();
        return;
    }

    if (now < cd_deadline)
    {
        countdownDuration = (cd_deadline - now) / 1000UL;
    }
    else
    {
        countdownDuration = 0;
        ModelHandle_StopCountdown();
        return;
    }
}

/***************************************************************
 * ========================= TWIST MODE =========================
 ***************************************************************/
TwistSettings twistSettings;

static bool     twist_on_phase = false;
static uint32_t twist_deadline = 0;

void ModelHandle_StartTwist(uint16_t on_s, uint16_t off_s,
                            uint8_t onH, uint8_t onM,
                            uint8_t offH, uint8_t offM)
{
    clear_all_modes();

    if (on_s == 0)  on_s = 1;
    if (off_s == 0) off_s = 1;

    twistSettings.onDurationSeconds  = on_s;
    twistSettings.offDurationSeconds = off_s;

    twistSettings.onHour   = onH;
    twistSettings.onMinute = onM;
    twistSettings.offHour  = offH;
    twistSettings.offMinute= offM;

    twistSettings.twistArmed  = true;
    twistSettings.twistActive = false;

    twist_on_phase = true;
    twist_deadline = now_ms() + (on_s * 1000UL);

    start_motor();
}

void ModelHandle_StopTwist(void)
{
    twistActive = false;
    twistSettings.twistActive = false;
    stop_motor();
}

/* Check if twist should start / stop based on RTC clock */
static void twist_time_logic(void)
{
    if (!twistSettings.twistArmed)
        return;

    /* Start twist at ON time */
    if (!twistActive &&
        time.hour == twistSettings.onHour &&
        time.min  == twistSettings.onMinute)
    {
        twistActive = true;
        twistSettings.twistActive = true;

        twist_on_phase = true;
        twist_deadline = now_ms() + twistSettings.onDurationSeconds * 1000UL;

        start_motor();
    }

    /* Stop twist at OFF time */
    if (twistActive &&
        time.hour == twistSettings.offHour &&
        time.min  == twistSettings.offMinute)
    {
        ModelHandle_StopTwist();
    }
}

/* Twist ON/OFF cycling handler */
static void twist_tick(void)
{
    if (!twistActive)
        return;

    if (isTankFull())
    {
        ModelHandle_StopTwist();
        return;
    }

    uint32_t now = now_ms();

    if (now >= twist_deadline)
    {
        if (twist_on_phase)
        {
            twist_on_phase = false;
            stop_motor();
            twist_deadline = now + twistSettings.offDurationSeconds * 1000UL;
        }
        else
        {
            twist_on_phase = true;
            start_motor();
            twist_deadline = now + twistSettings.onDurationSeconds * 1000UL;
        }
    }

    /* Enforce correct state */
    if (twist_on_phase)
        start_motor();
    else
        stop_motor();
}

/***************************************************************
 * ======================== PROTECTIONS =========================
 ***************************************************************/
static void protections_tick(void)
{
    if (senseOverLoad || senseOverUnderVolt)
    {
        ModelHandle_StopAllModesAndMotor();
        return;
    }
}

/***************************************************************
 * =========================== LEDS =============================
 ***************************************************************/
static void leds_from_model(void)
{
    LED_ClearAllIntents();

    /* Motor ON → GREEN steady */
    if (Motor_GetStatus())
        LED_SetIntent(LED_COLOR_GREEN, LED_MODE_STEADY, 0);

    /* Auto/timer retry (dry-run) → GREEN blink */
    if (!senseDryRun && (autoActive || timerActive))
        LED_SetIntent(LED_COLOR_GREEN, LED_MODE_BLINK, 350);

    /* Pump OFF due to dry-run → RED steady */
    if (!senseDryRun && !Motor_GetStatus())
        LED_SetIntent(LED_COLOR_RED, LED_MODE_STEADY, 0);

    /* Max run reached → RED blink */
    if (senseMaxRunReached)
        LED_SetIntent(LED_COLOR_RED, LED_MODE_BLINK, 300);

    /* Overload → BLUE blink */
    if (senseOverLoad)
        LED_SetIntent(LED_COLOR_BLUE, LED_MODE_BLINK, 350);

    /* Voltage fault → PURPLE blink */
    if (senseOverUnderVolt)
        LED_SetIntent(LED_COLOR_PURPLE, LED_MODE_BLINK, 350);

    LED_ApplyIntents();
}

/***************************************************************
 * ========================== MASTER FSM ========================
 ***************************************************************/
void ModelHandle_Process(void)
{
    protections_tick();
    twist_time_logic();

    /*********************** AUTO *************************/
    if (autoActive)
    {
        auto_tick();
        leds_from_model();
        return;
    }

    /********************* SEMI-AUTO ***********************/
    if (semiAutoActive)
    {
        senseDryRun = false;   // ignored in semi-auto

        if (!isTankFull())
        {
            if (!Motor_GetStatus())
                start_motor();
        }
        else
        {
            stop_motor();
            semiAutoActive = false;   // auto-finish
        }

        leds_from_model();
        return;
    }

    /*********************** TIMER *************************/
    if (timerActive)
    {
        timer_tick();
        leds_from_model();
        return;
    }



    /********************* COUNTDOWN ***********************/
    if (countdownActive)
    {
        countdown_tick();

        /* Tank full cancels countdown */
        if (isTankFull())
        {
            ModelHandle_StopCountdown();
            leds_from_model();
            return;
        }

        /* ALWAYS keep motor ON */
        if (!Motor_GetStatus())
            start_motor();

        leds_from_model();
        return;
    }

    /************************ TWIST ************************/
    if (twistActive)
    {
        twist_tick();
        leds_from_model();
        return;
    }

    /************************ MANUAL ***********************/
    if (manualActive)
    {
        leds_from_model();
        return;
    }

    /********************** IDLE ***************************/
    stop_motor();
    leds_from_model();
}

/***************************************************************
 * ========================== RESET ALL =========================
 ***************************************************************/
void ModelHandle_ResetAll(void)
{
    clear_all_modes();
    stop_motor();

    senseDryRun         = false;
    senseOverLoad       = false;
    senseOverUnderVolt  = false;
    senseMaxRunReached  = false;

    countdownDuration = 0;

    UART_SendStatusPacket();
}

/***************************************************************
 * ===================== AUTO SETTINGS API ======================
 ***************************************************************/
void ModelHandle_SetAutoSettings(uint16_t gap_s, uint16_t maxrun_min, uint8_t retry)
{
    auto_gap_s       = gap_s;
    auto_maxrun_min  = maxrun_min;
    auto_retry_limit = retry;

    // Optional: save to EEPROM
    EEPROM_WriteBuffer(0x0300, (uint8_t*)&auto_gap_s, sizeof(auto_gap_s));
    EEPROM_WriteBuffer(0x0302, (uint8_t*)&auto_maxrun_min, sizeof(auto_maxrun_min));
    EEPROM_WriteBuffer(0x0304, (uint8_t*)&auto_retry_limit, sizeof(auto_retry_limit));
}
void ModelHandle_LoadAutoSettings()
{
    EEPROM_ReadBuffer(0x0300, (uint8_t*)&auto_gap_s, sizeof(auto_gap_s));
    EEPROM_ReadBuffer(0x0302, (uint8_t*)&auto_maxrun_min, sizeof(auto_maxrun_min));
    EEPROM_ReadBuffer(0x0304, (uint8_t*)&auto_retry_limit, sizeof(auto_retry_limit));
}


bool ModelHandle_IsAutoActive(void)
{
    return autoActive;
}

/***************************************************************
 * ============= EEPROM STATE SAVE (ONLY MODE FLAG) =============
 ***************************************************************/
void ModelHandle_SaveCurrentStateToEEPROM(void)
{
    RTC_PersistState s;
    memset(&s, 0, sizeof(s));

    /* Encode mode */
    if      (manualActive)    s.mode = 1;
    else if (semiAutoActive)  s.mode = 2;
    else if (timerActive)     s.mode = 3;
    else if (countdownActive) s.mode = 4;
    else if (twistActive)     s.mode = 5;
    else if (autoActive)      s.mode = 6;
    else                      s.mode = 0;

    RTC_SavePersistentState(&s);
}

/***************************************************************
 * ===================== TIMER SLOT SETTER ======================
 ***************************************************************/
void ModelHandle_SetTimerSlot(uint8_t slot,
                              uint8_t onH, uint8_t onM,
                              uint8_t offH, uint8_t offM)
{
    if (slot >= 5) return;

    timerSlots[slot].onHour    = onH;
    timerSlots[slot].onMinute  = onM;
    timerSlots[slot].offHour   = offH;
    timerSlots[slot].offMinute = offM;
}

